{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "linear1",
    "linear2",
    "img_mlp.fc1",
    "img_attn_proj",
    "txt_attn_proj",
    "txt_mlp.fc2",
    "img_mod.linear",
    "img_attn_qkv",
    "img_mlp.fc2",
    "modulation.linear",
    "txt_mlp.fc1",
    "txt_mod.linear",
    "txt_attn_qkv"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}